dwijaybane/msp430/Source Files/gpio.c
     ASSERT(0x00 != (selectedPins & (GPIO_PIN0 + GPIO_PIN1 + GPIO_PIN2 + 
                                     GPIO_PIN3 + GPIO_PIN4 + GPIO_PIN5 + 
                                     GPIO_PIN6 + GPIO_PIN7 + GPIO_PIN8 + 
                                     GPIO_PIN9 + GPIO_PIN10 + GPIO_PIN11 +
                                     GPIO_PIN12 + GPIO_PIN13 + GPIO_PIN14 +  
                                     GPIO_PIN15
             )));
			 
	unsigned int baseAddress  = GPIO_getBaseAddress(selectedPort);
	
	ASSERT((0xFFFF != baseAddress) );
    if(0xFFFF == baseAddress)
	{
		return;
	}
    ASSERT((driveStrength == GPIO_REDUCED_OUTPUT_DRIVE_STRENGTH) ||
        (driveStrength == GPIO_FULL_OUTPUT_DRIVE_STRENGTH)
        );

    switch (selectedPort){
        case GPIO_PORT_P1:
		case GPIO_PORT_P3:
		case GPIO_PORT_P5:
		case GPIO_PORT_P7:
		case GPIO_PORT_P9:
            if (GPIO_REDUCED_OUTPUT_DRIVE_STRENGTH == driveStrength){
                HWREGB(baseAddress + OFS_P1DS) &= (unsigned char) ~selectedPins;
            } else   {
                HWREGB(baseAddress + OFS_P1DS) |= (unsigned char) selectedPins;
            }
            break;

        case GPIO_PORT_P2:
		case GPIO_PORT_P4:
		case GPIO_PORT_P6:
		case GPIO_PORT_P8:
		case GPIO_PORT_P10:
            if (GPIO_REDUCED_OUTPUT_DRIVE_STRENGTH == driveStrength){
                HWREGB(baseAddress + OFS_P2DS) &= (unsigned char) ~selectedPins;
            } else  {
                HWREGB(baseAddress + OFS_P2DS) |= (unsigned char) selectedPins;
            }
            break;
    }
}

//*****************************************************************************
//
//Close the Doxygen group.
//! @}
//
//*****************************************************************************
